cases/vary_initial_concentrations/0.980C/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
  "libevaluateFlux_0_96HFunctionObject.so"
  "libinitExpFieldFunctionObject.so"
);

application     buoyantPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         24;

deltaT          1e-3;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   16;

runTimeModifiable true;

adjustTimeStep  no;

maxDeltaT       1e-2;

maxCo           0.5;

trapFpe    1;

functions
{

   initExpField
    {
      type initExpField;
      //outputControl     outputTime;
    }
    evaluateFlux_0_96H
    {
      type evaluateFlux_0_96H;
      //outputControl     outputTime;
    }



}
// ************************************************************************* //
