cases/vary_initial_concentrations/0.980C/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


expressions
(
    C
    {
        field       C;
        dimensions  [0 0 -3 0 1 0 0];

        constants
        {
            centre (0.09585 0 0);
        }

        variables
        (
            "vertLength = 0.0113"
        );

        condition
        #{
            (mag(pos() - $[(vector)constants.centre]) < vertLength)
//          && pos((pos() - $[(vector)constants.centre]).y()) > 0
        #};

        expression
        #{
//			  1
			  1 - pos().y()
//			  mag(pos() - $[(vector)constants.centre])
//			  mag(pos().y() - $[(vector)constants.centre].y())
//            0.5 + 0.5 * (1 - mag(pos() - $[(vector)constants.centre]) / radius)
        #};
    }
);


// ************************************************************************* //
